vp-services-camel/src/test/resources/testfiles/wsdl/ListCertificatesForCareWithQAInteraction_3.2_RIVTABP21.wsdl

<?xml version="1.0" encoding="UTF-8" ?>
<!-- Licensed to the Apache Software Foundation (ASF) under one or more contributor 
	license agreements. See the NOTICE file distributed with this work for additional 
	information regarding copyright ownership. Sveriges Kommuner och Landsting 
	licenses this file to you under the Apache License, Version 2.0 (the "License"); 
	you may not use this file except in compliance with the License. You may 
	obtain a copy of the License at http://www.apache.org/licenses/LICENSE-2.0 
	Unless required by applicable law or agreed to in writing, software distributed 
	under the License is distributed on an "AS IS" BASIS, WITHOUT WARRANTIES 
	OR CONDITIONS OF ANY KIND, either express or implied. See the License for 
	the specific language governing permissions and limitations under the License. -->
<wsdl:definitions name='ListCertificatesForCareWithQAInteraction'
	xmlns:wsdl='http://schemas.xmlsoap.org/wsdl/' xmlns:soap='http://schemas.xmlsoap.org/wsdl/soap/'
	xmlns:xs='http://www.w3.org/2001/XMLSchema'
	xmlns:tjsr='urn:riv:clinicalprocess:healthcond:certificate:ListCertificatesForCareWithQAResponder:3'
	xmlns:tns='urn:riv:clinicalprocess:healthcond:certificate:ListCertificatesForCareWithQA:3:rivtabp21'
	targetNamespace='urn:riv:clinicalprocess:healthcond:certificate:ListCertificatesForCareWithQA:3:rivtabp21'
	xmlns:itr='urn:riv:itintegration:registry:1'>
	
	<wsdl:documentation>
		Tjänsteinteraktionens namn: ListCertificatesForCareWithQAInteraction
		Beskrivning:
		Interaction to list certificates a patient's certificates for given care units
		including questions and answers for the certificate.
		Revisioner:
		2014-08-20: Utkast Version 1.0, mats.ekhammar@callistaenterprise.se
		2015-09-30 Version 2.0, johan.zetterstrom@callistaenterprise.se
		2017-03-29: Version 3.0, peter.hernfalk@callistaenterprise.se
		2017-05-08: Version 3.1, peter.hernfalk@callistaenterprise.se
		2018-06-14: Version 3.2, peter.hernfalk@callistaenterprise.se
		Tjänstedomän: clinicalprocess:healthcond:certificate
		Tjänsteinteraktionstyp: Fråga-svar
		WS-profil: RIVTABP21
	</wsdl:documentation>
	
	<wsdl:types>
		<xs:schema
			targetNamespace='urn:riv:clinicalprocess:healthcond:certificate:ListCertificatesForCareWithQA:3:rivtabp21'>
			<xs:import schemaLocation='ListCertificatesForCareWithQAResponder_3.2.xsd'
				namespace='urn:riv:clinicalprocess:healthcond:certificate:ListCertificatesForCareWithQAResponder:3' />
			<xs:import schemaLocation='../../core_components/itintegration_registry_1.0.xsd'
				namespace='urn:riv:itintegration:registry:1' />
		</xs:schema>
	</wsdl:types>
	
	<wsdl:message name='ListCertificatesForCareWithQARequest'>
		<wsdl:part name='LogicalAddress' element='itr:LogicalAddress'>
		</wsdl:part>
		<wsdl:part name='parameters' element='tjsr:ListCertificatesForCareWithQA' />
	</wsdl:message>
	
	<wsdl:message name='ListCertificatesForCareWithQAResponse'>
		<wsdl:part name='parameters' element='tjsr:ListCertificatesForCareWithQAResponse' />
	</wsdl:message>
	
	<wsdl:portType name='ListCertificatesForCareWithQAResponderInterface'>
		<wsdl:operation name='ListCertificatesForCareWithQA'>
			<wsdl:input message='tns:ListCertificatesForCareWithQARequest' />
			<wsdl:output message='tns:ListCertificatesForCareWithQAResponse' />
		</wsdl:operation>
	</wsdl:portType>
	
	<wsdl:binding name='ListCertificatesForCareWithQAResponderBinding'
		type='tns:ListCertificatesForCareWithQAResponderInterface'>
		<soap:binding style='document'
			transport='http://schemas.xmlsoap.org/soap/http' />
		<wsdl:operation name='ListCertificatesForCareWithQA'>
			<soap:operation
				soapAction='urn:riv:clinicalprocess:healthcond:certificate:ListCertificatesForCareWithQAResponder:3:ListCertificatesForCareWithQA'
				style='document' />
			<wsdl:input>
				<soap:header use='literal'
					message='tns:ListCertificatesForCareWithQARequest' part='LogicalAddress' />
				<soap:body use='literal' parts='parameters' />
			</wsdl:input>
			<wsdl:output>
				<soap:body use='literal' />
			</wsdl:output>
		</wsdl:operation>
	</wsdl:binding>
	
	<wsdl:service name='ListCertificatesForCareWithQAResponderService'>
		<wsdl:port name='ListCertificatesForCareWithQAResponderPort'
			binding='tns:ListCertificatesForCareWithQAResponderBinding'>
			<soap:address location='http://tempuri.org' />
		</wsdl:port>
	</wsdl:service>
	
</wsdl:definitions>
