web/src/test/resources/integrationtestTemplates/listCertificatesForCareWithQA.v3.stg

delimiters "$", "$"

request(data) ::= <<
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:riv:itintegration:registry:1" xmlns:urn1="urn:riv:clinicalprocess:healthcond:certificate:ListCertificatesForCareWithQAResponder:3" xmlns:urn2="urn:riv:clinicalprocess:healthcond:certificate:types:3">
   <soapenv:Header>
      <urn:LogicalAddress>1</urn:LogicalAddress>
   </soapenv:Header>
   <soapenv:Body>
      <urn1:ListCertificatesForCareWithQA>
         <urn1:person-id>
            <urn2:root>1.2.752.129.2.1.3.1</urn2:root>
            <urn2:extension>$data.personnummer$</urn2:extension>
         </urn1:person-id>
         <!--1 or more repetitions:-->
         <urn1:enhets-id>
            <urn2:root>1.2.752.129.2.1.4.1</urn2:root>
            <urn2:extension>$data.enhetsId$</urn2:extension>
         </urn1:enhets-id>
         <!--You may enter ANY elements at this point-->
      </urn1:ListCertificatesForCareWithQA>
   </soapenv:Body>
</soapenv:Envelope>
>>

brokenrequest() ::= <<
<not-even-valid-xml>This mess will trigger a soapfault</xml>
>>
